Repository: SkiljaGmbH/PlatformSamples
Catalog: SampleActivity/Properties/Resources.*.resx
Languages: de

# AppSettingsSettings_AppSettingsToOutput_Description
source: Comma separated list of AppSettings to output.
de: Durch Kommata getrennte Liste der auszugebenden AppSettings.

# AppSettingsSettings_AppSettingsToOutput_Name
source: AppSettings
de: AppEinstellungen

# AppSettingsSettings_OutputCustomValue_Description
source: Custom value where to output AppSettings.
de: Benutzerdefinierter Wert für die Ausgabe von AppSettings.

# AppSettingsSettings_OutputCustomValue_Name
source: Output Custom Value
de: Benutzerdefinierten Wert ausgeben

# CommonSettings_FilteringCustomValueName_Description
source: Filtering custom value name.
de: Filterung des benutzerdefinierten Wertes name.

# CommonSettings_FilteringCustomValueName_Name
source: Filtering Custom Value Name
de: Filtern Benutzerdefinierter Wert Name

# CommonSettings_RoutingCustomValueName_Description
source: Routing custom value name.
de: Name des benutzerdefinierten Routingwerts.

# CommonSettings_RoutingCustomValueName_Name
source: Routing Custom Value Name
de: Routing Benutzerdefinierter Wert Name

# ConfigurationValidationSettings_DocumentType_Description
source: Property used to demonstrate the validation of assigned document types. If this property is set, validation fails if the document type with the matching name is not assignes to the process hosting the activity.
de: Eigenschaft, die verwendet wird, um die Validierung von zugewiesenen Dokumenttypen zu demonstrieren. Wenn diese Eigenschaft gesetzt ist, schlägt die Validierung fehl, wenn der Dokumenttyp mit dem passenden Namen dem Prozess, der die Aktivität hostet, nicht zugewiesen ist.

# ConfigurationValidationSettings_DocumentType_Name
source: Document Type
de: Dokumenttyp

# ConfigurationValidationSettings_FilePath_Description
source: Just a path to a file
de: Nur ein Pfad zu einer Datei

# ConfigurationValidationSettings_FilePath_Name
source: File Path
de: Datei-Pfad

# ConfigurationValidationSettings_IfThisIsTrue_Description
source: If IfThisIsTrue is true, then ThisMustNotBeEmpty must not be empty
de: Wenn IfThisIsTrue wahr ist, dann darf ThisMustNotBeEmpty nicht leer sein

# ConfigurationValidationSettings_IfThisIsTrue_GroupName
source: Just a Group
de: Nur eine Gruppe

# ConfigurationValidationSettings_IfThisIsTrue_Name
source: If This Is True
de: Wenn dies wahr ist

# ConfigurationValidationSettings_ThisMustBeInTheFuture_Description
source: This Date Must Be In The Future
de: Dieses Datum muss in der Zukunft liegen

# ConfigurationValidationSettings_ThisMustBeInTheFuture_GroupName
source: Just another Group
de: Nur eine weitere Gruppe

# ConfigurationValidationSettings_ThisMustBeInTheFuture_Name
source: This Must Be In The Future
de: Das muss in der Zukunft liegen

# ConfigurationValidationSettings_ThisMustBeInThePast_Description
source: This Date Must Be In The Past
de: Dieses Datum muss in der Vergangenheit liegen

# ConfigurationValidationSettings_ThisMustBeInThePast_GroupName
source: Just another Group
de: Nur eine weitere Gruppe

# ConfigurationValidationSettings_ThisMustBeInThePast_Name
source: This Must Be In The Past
de: Das muss der Vergangenheit angehören

# ConfigurationValidationSettings_ThisMustNotBeEmpty_Description
source: If IfThisIsTrue is true, then ThisMustNotBeEmpty must not be empty
de: Wenn IfThisIsTrue wahr ist, dann darf ThisMustNotBeEmpty nicht leer sein

# ConfigurationValidationSettings_ThisMustNotBeEmpty_GroupName
source: Just a Group
de: Nur eine Gruppe

# ConfigurationValidationSettings_ThisMustNotBeEmpty_Name
source: This Must Not Be Empty
de: Das darf nicht leer sein

# ConfigurationValidationSettings_Validations_DocumentTypeNotAssigned
source: The configured document type '{0}' is not assigned to the current process.
de: Der konfigurierte Dokumenttyp '{0}' ist dem aktuellen Prozess nicht zugewiesen.

# ConfigurationValidationSettings_Validations_DuplicateColumnDetected
source: Duplicate column definition detected. The column '{0}' is defined in {1} tables of the assigned document type ({2}). This might cause issues in processing.
de: Doppelte Spaltendefinition entdeckt. Die Spalte '{0}' ist in {1} Tabellen der zugeordneten Dokumentart ({2}) definiert. Dies kann zu Problemen bei der Verarbeitung führen.

# ConfigurationValidationSettings_Validations_FilePath_Missing
source: The file specified in FilePath does not exist.
de: Die in FilePath angegebene Datei existiert nicht.

# ConfigurationValidationSettings_Validations_NoDocumentType
source: This activity expects has configured a document type to be used, but there are no document types assigned to the process
de: Diese Aktivität erwartet, dass eine Dokumentart konfiguriert wurde, die verwendet werden soll, aber dem Prozess sind keine Dokumentarten zugewiesen.

# ConfigurationValidationSettings_Validations_ThisMustBeInTheFuture_NotInFuture
source: ThisMustBeInTheFuture must be in the future!
de: IfThisIsTrue ist wahr, aber ThisMustNotBeEmpty ist leer!

# ConfigurationValidationSettings_Validations_ThisMustBeInThePast_NotInPast
source: ThisMustBeInThePast must be in the past!
de: ThisMustBeInThePast muss in der Vergangenheit liegen!

# ConfigurationValidationSettings_Validations_ThisMustNotBeEmpty_Empty
source: IfThisIsTrue is true, but ThisMustNotBeEmpty is empty!
de: ThisMustBeInTheFuture muss in der Zukunft liegen!

# ExportSettings_Common_Name
source: Routing and Filtering Settings
de: Einstellungen für Routing und Filterung

# ExportSettings_ExportMediaMappings_Description
source: Maps media to be exported to the extensions of exported files
de: Ordnet die zu exportierenden Medien den Erweiterungen der exportierten Dateien zu

# ExportSettings_ExportMediaMappings_Name
source: Media Mapping
de: Medien-Mapping

# ExportSettings_ExportPath_Description
source: Path to where the files are going to be exported
de: Pfad zu den Dateien, die exportiert werden sollen

# ExportSettings_ExportPath_Name
source: Export Path
de: Pfad exportieren

# ExportSettings_FlatExport_Description
source: All the files are put in the same (export) folder
de: Alle Dateien werden in denselben (Export-)Ordner gelegt

# ExportSettings_FlatExport_Name
source: Flat Export
de: Flacher Export

# ImportSettings_Common_Description
source: Common settings.
de: Gemeinsame Einstellungen.

# ImportSettings_Common_Name
source: Common Settings
de: Gemeinsame Einstellungen

# ImportSettings_DocumentType_Name
source: Document Type
de: Dokumenttyp

# ImportSettings_ImportPath_Description
source: Import path.
de: Pfad importieren.

# ImportSettings_ImportPath_Name
source: Import Path
de: Pfad importieren

# OverdueAgentSettings_DaysOverdue_Description
source: Number of days the work item must be in the overdue SLA status in order to be counted for notification.
de: Anzahl der Tage, die das Workitem im überfälligen SLA-Status sein muß, um für die Benachrichtigung gezählt zu werden.

# OverdueAgentSettings_DaysOverdue_GroupName
source: 02 - Notification
de: 02 - Benachrichtigung

# OverdueAgentSettings_DaysOverdue_Name
source: Days Overdue
de: Überfällige Tage

# OverdueAgentSettings_DaysOverdue_Values_1
source: One day or more
de: Ein Tag oder mehr

# OverdueAgentSettings_DaysOverdue_Values_2
source: Two Days or more
de: Zwei Tage oder mehr

# OverdueAgentSettings_DaysOverdue_Values_3
source: Three days or more
de: Drei Tage oder mehr

# OverdueAgentSettings_DaysOverdue_Values_5
source: Five days or more
de: Fünf Tage oder mehr

# OverdueAgentSettings_DaysOverdue_Values_7
source: A week or more
de: Eine Woche oder länger

# OverdueAgentSettings_IncludeCloseTo_Description
source: If this option is selected, the agent will count also work items that are in the CloseTo status.
de: Wenn diese Option ausgewählt ist, zählt der Agent auch Workitems, die sich im Status Abgeschlossen bis befinden.

# OverdueAgentSettings_IncludeCloseTo_GroupName
source: 02 - Notification
de: 02 - Benachrichtigung

# OverdueAgentSettings_IncludeCloseTo_Name
source: Including CloseTo
de: Einschließlich CloseTo

# OverdueAgentSettings_ReadMe_Description
source: Explains what this system agent does.
de: Erläutert, was dieser Systemagent tut.

# OverdueAgentSettings_ReadMe_GroupName
source: 01 - Description
de: 01 - Beschreibung

# OverdueAgentSettings_Readme_Prompt
source: This system agent ticks as configured on the process settings tab. With every tick it counts the number of work items that have the SLA status in Overdue (and alternatively in Close To, depending on the configuration) and that they are in this status for longer than configured number of days. If there are such work items the agent will compose a mail like this: 'Dear <Send To>. We have detected that the process <name of the process> have <number of work items> work items in Overdue for more than <Days Overdue>. Kind regards.' This e-mail will be sent on the e-mail configured in Send To Address property using SMTP server as configured in SMTP Server Settings property. Please make sure you do not tick too often, or this agent will spam the receiver.
de: Dieser Systemagent tickt wie auf der Registerkarte Prozesseinstellungen konfiguriert. Mit jedem Häkchen zählt er die Anzahl der Workitems, die den SLA-Status „überfällig“ (oder alternativ „erledigt“, je nach Konfiguration) haben und die sich länger als die konfigurierte Anzahl von Tagen in diesem Status befinden. Wenn es solche Workitems gibt, verfasst der Agent eine Mail wie diese: 'Sehr geehrter <Send To>. Wir haben festgestellt, dass der Prozess <Name des Prozesses> <Anzahl der Workitems> Workitems hat, die seit mehr als <Tagen überfällig> sind. Mit freundlichen Grüßen.' Diese E-Mail wird an die in der Eigenschaft Adresse senden konfigurierte E-Mail unter Verwendung des SMTP-Servers gesendet, der in der Eigenschaft SMTP-Servereinstellungen konfiguriert ist. Bitte stellen Sie sicher, dass Sie das Häkchen nicht zu oft setzen, da der Agent sonst den Empfänger mit Spam bombardiert.

# OverdueAgentSettings_SendToMail_Description
source: The E-mail address where the notification mail will be sent to.
de: Die E-Mail-Adresse, an die die Benachrichtigung gesendet werden soll.

# OverdueAgentSettings_SendToMail_GroupName
source: 03 - E-Mail Settings
de: 03 - E-Mail-Einstellungen

# OverdueAgentSettings_SendToMail_Name
source: Send To Address
de: Senden an Adresse

# OverdueAgentSettings_SendTo_Description
source: The name of the receiver.
de: Der Name des Empfängers.

# OverdueAgentSettings_SendTo_GroupName
source: 03 - E-Mail Settings
de: 03 - E-Mail-Einstellungen

# OverdueAgentSettings_SendTo_Name
source: Send To
de: Senden an

# OverdueAgentSettings_ServerSettings_Description
source: Configuration of the SMTP server to be used for sending notification e-mails.
de: Konfiguration des SMTP-Servers, der für den Versand von Benachrichtigungs-E-Mails verwendet werden soll.

# OverdueAgentSettings_ServerSettings_GroupName
source: 03 - E-Mail Settings
de: 03 - E-Mail-Einstellungen

# OverdueAgentSettings_ServerSettings_Name
source: SMTP Server Settings
de: SMTP-Server-Einstellungen

# WatermarkSettings_Common_Name
source: Routing and Filtering Settings
de: Einstellungen für Routing und Filterung

# WatermarkSettings_WatermarkText_Name
source: Watermark Text
de: Text des Wasserzeichens
