Repository: SkiljaGmbH/PlatformSamples
Catalog: ActivitySettings/Properties/Resources.*.resx
Languages: de

# ActivityConfiguration_JSONSettings_Name
source: JSON File
de: JSON-Datei

# ActivityConfiguration_JSONSettings_Description
source: JSON file sample
de: Beispiel einer JSON-Datei

# ActivityConfiguration_JSONSettings_GroupName
source: 2. Binary File
de: 2. Binärdatei

# ActivityConfiguration_JSONSettingsDesc_Name
source: JSON File Description
de: JSON-Datei Beschreibung

# ActivityConfiguration_JSONSettingsDesc_Description
source: JSON file sample
de: Beispiel einer JSON-Datei

# ActivityConfiguration_JSONSettingsDesc_GroupName
source: 2. Binary File
de: 2. Binärdatei

# ActivityConfiguration_CheckBoxData_Name
source: Check box data
de: Daten des Kontrollkästchens

# ActivityConfiguration_CheckBoxData_Description
source: Check box sample
de: Muster des Kontrollkästchens

# ActivityConfiguration_CheckBoxData_GroupName
source: 1. Dependant settings
de: 1. Abhängige Einstellungen

# ActivityConfiguration_CBDependentItem_Name
source: Check box dependent item
de: Kontrollkästchen abhängige Position

# ActivityConfiguration_CBDependentItem_Description
source: Item dependent on a check box
de: Artikel abhängig von einem Kontrollkästchen

# ActivityConfiguration_CBDependentItem_GroupName
source: 1. Dependant settings
de: 1. Abhängige Einstellungen

# ActivityConfiguration_LstDependent_Name
source: Check box dependent list
de: Checkbox-abhängige Liste

# ActivityConfiguration_LstDependent_Description
source: Item list dependent on a check box
de: Artikelliste abhängig von einem Kontrollkästchen

# ActivityConfiguration_LstDependent_GroupName
source: 1. Dependant settings
de: 1. Abhängige Einstellungen

# ActivityConfiguration_CBDependencyDesc_Name
source: Dependency Description
de: Abhängigkeit Beschreibung

# ActivityConfiguration_CBDependencyDesc_Description
source: JSON file sample
de: Beispiel einer JSON-Datei

# ActivityConfiguration_CBDependencyDesc_GroupName
source: 1. Dependant settings
de: 1. Abhängige Einstellungen

# ActivityConfiguration_DatabaseLookup_Name
source: Database Lookup
de: Datenbank-Suche

# ActivityConfiguration_DatabaseLookup_Description
source: Database lookup settings
de: Einstellungen für die Datenbankabfrage

# ActivityConfiguration_DatabaseLookup_GroupName
source: 3. Database Lookups (Complex classes)
de: 3. Datenbankabfragen (Komplexe Klassen)

# ActivityConfiguration_DBLookupDesc_Name
source: Database Lookup Description
de: Datenbank Lookup Beschreibung

# ActivityConfiguration_DBLookupDesc_Description
source: JSON file sample
de: Beispiel einer JSON-Datei

# ActivityConfiguration_DBLookupDesc_GroupName
source: 3. Database Lookups (Complex classes)
de: 3. Datenbankabfragen (Komplexe Klassen)

# ActivityConfiguration_MediaType_Name
source: Media Type selector
de: Medien-Typ-Auswahl

# ActivityConfiguration_MediaType_Description
source: Stores the one of available media types
de: Speichert einen der verfügbaren Medientypen

# ActivityConfiguration_MediaType_GroupName
source: Platform data
de: Daten der Plattform

# ActivityConfiguration_DocumentType_Name
source: Document Type selector
de: Auswahl des Dokumenttyps

# ActivityConfiguration_DocumentType_Description
source: Stores the one of document types assigned to the process
de: Speichert die dem Prozess zugeordneten Dokumenttypen

# ActivityConfiguration_DocumentType_GroupName
source: Platform data
de: Daten der Plattform

# ActivityConfiguration_IndexFields_Name
source: Selected fields
de: Ausgewählte Felder

# ActivityConfiguration_IndexFields_Description
source: Stores the subset of the fields from the document type above
de: Speichert die Untermenge der Felder des obigen Dokumenttyps

# ActivityConfiguration_IndexFields_GroupName
source: Platform data
de: Daten der Plattform

# ActivityConfiguration_PlatformDataDesc_Name
source: Platform Data Description
de: Plattform Daten Beschreibung

# ActivityConfiguration_PlatformDataDesc_Description
source: Describes usage of the platform data
de: Beschreibt die Nutzung der Daten der Plattform

# ActivityConfiguration_PlatformDataDesc_GroupName
source: Platform data
de: Daten der Plattform

# ExternalSettings_StringProperty_Name
source: String Property
de: String-Eigenschaft

# ExternalSettings_StringProperty_Description
source: Property of type string
de: Eigenschaft vom Typ String

# ExternalSettings_StringProperty_GroupName
source: Simple properties
de: Einfache Eigenschaften

# ExternalSettings_PwdProperty_Name
source: Password Property
de: Passwort-Eigenschaft

# ExternalSettings_PwdProperty_Description
source: Property of type string with password characters
de: Eigenschaft vom Typ String mit Passwort-Zeichen

# ExternalSettings_PwdProperty_GroupName
source: Simple properties
de: Einfache Eigenschaften

# ExternalSettings_LongStringProperty_Name
source: String Property (long)
de: String-Eigenschaft (long)

# ExternalSettings_LongStringProperty_Description
source: Property of type string with area input
de: Eigenschaft vom Typ String mit Flächeneingabe

# ExternalSettings_LongStringProperty_GroupName
source: Simple properties
de: Einfache Eigenschaften

# ExternalSettings_DoubleProperty_Name
source: Double Property
de: Double-Eigenschaft

# ExternalSettings_DoubleProperty_Description
source: Property of type double
de: Eigenschaft vom Typ double

# ExternalSettings_DoubleProperty_GroupName
source: Simple properties
de: Einfache Eigenschaften

# ExternalSettings_BooleanProperty_Name
source: Boolean Property
de: Boolesche Eigenschaft

# ExternalSettings_BooleanProperty_Description
source: Property of type boolean
de: Eigenschaft vom Typ Boolean

# ExternalSettings_BooleanProperty_GroupName
source: Simple properties
de: Einfache Eigenschaften

# ExternalSettings_DateTimeProperty_Name
source: DateTime Property
de: DateTime-Eigenschaft

# ExternalSettings_DateTimeProperty_Description
source: Property of type date time
de: Eigenschaft vom Typ Datum Zeit

# ExternalSettings_DateTimeProperty_GroupName
source: Simple properties
de: Einfache Eigenschaften

# ExternalSettings_ColorProperty_Name
source: Color Property
de: Farbeigenschaft

# ExternalSettings_ColorProperty_Description
source: Property of type color
de: Eigenschaft vom Typ color

# ExternalSettings_ColorProperty_GroupName
source: Simple properties
de: Einfache Eigenschaften

# ExternalSettings_EnumPropertyCombo_Name
source: Combo With Enumerator
de: Combo mit Zähler

# ExternalSettings_EnumPropertyCombo_Description
source: Combo box for enumeration type property
de: Kombinationsfeld für Aufzählungstyp-Eigenschaft

# ExternalSettings_EnumPropertyCombo_GroupName
source: Complex properties
de: Komplexe Eigenschaften

# ExternalSettings_EnumPropertyCombo_Values_0
source: EnumeratorValue1
de: AufzählerWert1

# ExternalSettings_EnumPropertyCombo_Values_1
source: EnumeratorValue2
de: AufzählerWert2

# ExternalSettings_EnumPropertyCombo_Values_2
source: EnumeratorValue3
de: AufzählerWert3

# ExternalSettings_EnumPropertyCombo_Values_3
source: EnumeratorValue4
de: AufzählerWert4

# ExternalSettings_IntegerCombo_Name
source: Combo With dictionary
de: Combo mit Wörterbuch

# ExternalSettings_IntegerCombo_Description
source: Combo box for integer dictionary property
de: Kombinationsfeld für Integer-Wörterbuch-Eigenschaft

# ExternalSettings_IntegerCombo_GroupName
source: Complex properties
de: Komplexe Eigenschaften

# ExternalSettings_IntegerCombo_Values_1
source: One
de: Eine

# ExternalSettings_IntegerCombo_Values_2
source: Two
de: Zwei

# ExternalSettings_IntegerCombo_Values_3
source: Three
de: Drei

# ExternalSettings_CommaDelimitedCombo_Name
source: Combo With comma delimited values
de: Combo Mit durch Komma getrennten Werten

# ExternalSettings_CommaDelimitedCombo_Description
source: Combo box for comma delimited strings property
de: Kombinationsfeld für kommagetrennte Strings Eigenschaft

# ExternalSettings_CommaDelimitedCombo_GroupName
source: Complex properties
de: Komplexe Eigenschaften

# ExternalSettings_DocumentTypeSelection_Name
source: Available document types
de: Verfügbare Dokumenttypen

# ExternalSettings_DocumentTypeSelection_Description
source: Drop-down with document types assigned to the process
de: Dropdown mit den dem Prozess zugeordneten Dokumenttypen

# ExternalSettings_DocumentTypeSelection_GroupName
source: Complex properties
de: Komplexe Eigenschaften

# ExternalSettings_DocumentTypeSelection_Values_document
source: document
de: Dokument

# ExternalSettings_MediaTypeSelection_Name
source: Available media types
de: Verfügbare Medientypen

# ExternalSettings_MediaTypeSelection_Description
source: Drop down with all media types available in the platform
de: Dropdown-Liste mit allen auf der Plattform verfügbaren Medientypen

# ExternalSettings_MediaTypeSelection_GroupName
source: Complex properties
de: Komplexe Eigenschaften

# ExternalSettings_MediaTypeSelection_Values_media
source: media
de: Medien

# ExternalSettings_FileUploadProperty_Name
source: File Upload
de: Datei Importieren

# ExternalSettings_FileUploadProperty_Description
source: File uploader for string property
de: Dateiuploader für String-Eigenschaft

# ExternalSettings_FileUploadProperty_GroupName
source: Complex properties
de: Komplexe Eigenschaften

# ExternalSettings_GridProperty_Name
source: Dummy Grid
de: Dummy-Gitter

# ExternalSettings_GridProperty_Description
source: Grid for string dictionary property
de: Raster für String-Wörterbuch-Eigenschaft

# ExternalSettings_GridProperty_GroupName
source: Complex properties
de: Komplexe Eigenschaften

# ExternalSettings_NestedClassProperty_Name
source: Nested Class
de: Verschachtelte Klasse

# ExternalSettings_NestedClassProperty_Description
source: Nested class with file uploader as a property
de: Verschachtelte Klasse mit Datei-Uploader als Eigenschaft

# ExternalSettings_SelectedFields_Name
source: Multi Field Selector
de: Multi-Feld-Selektor

# ExternalSettings_SelectedFields_Description
source: Showcase that demonstrates how to select fields to be used in the configuration
de: Showcase, der zeigt, wie man Felder für die Konfiguration auswählt

# ExternalSettings_AssignedFields_Name
source: Field Assigner
de: Feld-Zuweiser

# ExternalSettings_AssignedFields_Description
source: Showcase that demonstrates how to assign fields to be used in the configuration
de: Showcase, der die Zuweisung von Feldern zur Verwendung in der Konfiguration demonstriert

# ExternalSettings_SelectedField_Name
source: Single Field Selector
de: Einzelfeld-Selektor

# ExternalSettings_SelectedField_Description
source: Showcase that demonstrates how to select a single field to be used in the configuration
de: Showcase, in dem gezeigt wird, wie ein einzelnes Feld zur Verwendung in der Konfiguration ausgewählt wird

# ExternalSettings_StringMultiValueProperty_Name
source: List Of Emails
de: Liste der Emails

# ExternalSettings_StringMultiValueProperty_Description
source: Showcase that demonstrate how to use a list as a property that accepts entering of e-mails. Variable input on this property is disabled
de: Showcase, der zeigt, wie man eine Liste als Eigenschaft verwendet, die die Eingabe von E-Mails akzeptiert. Die Variableneingabe für diese Eigenschaft ist deaktiviert

# ExternalSettings_StringMultiValueProperty_GroupName
source: Complex properties
de: Komplexe Eigenschaften

# ExternalSettings_IntMultiValueProperty_Name
source: List of integers with min length
de: Liste von Integers mit Mindestlänge

# ExternalSettings_IntMultiValueProperty_Description
source: Showcase that demonstrate how to use a list as a property that accepts entering integer numbers that are considered invalid if they are shorter than 2 digits. This sample also demonstrates that list entry type can be auto-detected Variable input on this property is disabled
de: Showcase zur Demonstration der Verwendung einer Liste als Eigenschaft, die die Eingabe von Integer-Zahlen zulässt, die als ungültig betrachtet werden, wenn sie kürzer als 2 Ziffern sind. Dieses Beispiel zeigt auch, dass der Typ der Listeneingabe automatisch erkannt werden kann. Die Variableneingabe für diese Eigenschaft ist deaktiviert.

# ExternalSettings_IntMultiValueProperty_GroupName
source: Complex properties
de: Komplexe Eigenschaften

# ExternalSettings_IntMultiValueProperty_MinLengthAttribute_ErrorMessage
source: Min length of list items must be 2 characters
de: Die Mindestlänge der Listenelemente muss 2 Zeichen betragen.

# ExternalSettings_DoubleMultiValueProperty_Name
source: List Of Doubles
de: Liste der Doubles

# ExternalSettings_DoubleMultiValueProperty_Description
source: Showcase that demonstrate how to use a list as a property that accepts entering of valid numbers and usage of variables on list items.
de: Showcase zur Demonstration der Verwendung einer Liste als Eigenschaft, die die Eingabe gültiger Zahlen und die Verwendung von Variablen in Listenelementen zulässt.

# ExternalSettings_DoubleMultiValueProperty_GroupName
source: Complex properties
de: Komplexe Eigenschaften

# DatabaseConnection_DatabaseName_Name
source: Database name
de: Name der Datenbank

# DatabaseConnection_DatabaseName_RequiredAttribute_ErrorMessage
source: Data is required.
de: Daten sind erforderlich.

# DatabaseConnection_IntegratedSecurity_Name
source: Integrated security
de: Integrierte Sicherheit

# DatabaseConnection_Password_Name
source: Password
de: Kennwort

# DatabaseConnection_ServerName_Name
source: Server name
de: Name des Servers

# DatabaseConnection_ServerName_RequiredAttribute_ErrorMessage
source: Data is required.
de: Daten sind erforderlich.

# DatabaseConnection_Username_Name
source: Username
de: Benutzername

# DatabaseLookup_Columns_Description
source: Columns with column display name
de: Spalten mit Spaltenanzeigename

# DatabaseLookup_Columns_Name
source: Table Columns
de: Tabellenspalten

# DatabaseLookup_DatabaseConnection_Description
source: Database connection settings
de: Einstellungen für die Datenbankverbindung

# DatabaseLookup_DatabaseConnection_Name
source: Database Connection
de: Datenbank-Verbindung

# DatabaseLookup_FullTextColumns_Description
source: Columns used in full text search delimited by comma
de: In der Volltextsuche verwendete Spalten durch Komma getrennt

# DatabaseLookup_FullTextColumns_Name
source: Full text search columns (comma-separated)
de: Spalten für die Volltextsuche (kommagetrennt)

# DatabaseLookup_FullTextSearch_Description
source: Support for full text search
de: Unterstützung für Volltextsuche

# DatabaseLookup_FullTextSearch_Name
source: Allow full text search
de: Volltextsuche zulassen

# DatabaseLookup_MaxResults_Description
source: Maximum number of results returned
de: Maximale Anzahl der zurückgegebenen Ergebnisse

# DatabaseLookup_MaxResults_Name
source: Max returned results
de: Maximal zurückgegebene Ergebnisse

# DatabaseLookup_Name_Description
source: Lookup name
de: Name der Nachschlagefunktion

# DatabaseLookup_TableName_Description
source: Table name
de: Name der Tabelle

# DatabaseLookup_TableName_Name
source: Table name
de: Tabellenname

# NestedWithFiles_SelectedField_Description
source: Showcase that demonstrates how to select single field to be used in the configuration
de: Showcase, der zeigt, wie man ein einzelnes Feld auswählt, das in der Konfiguration verwendet werden soll

# NestedWithFiles_SelectedField_Name
source: Single Field Selector
de: Einzelfeld-Selektor

# NestedWithFiles_UploadedFile_Description
source: File upload with File Object property that allows setting of the variables
de: Datei-Upload mit File-Objekt-Eigenschaft, die die Einstellung der Variablen ermöglicht

# NestedWithFiles_UploadedFile_Name
source: File Upload with object
de: Datei-Upload mit Objekt
